/**
 * @file    Single_action_data.c
 * @brief   存放单一动作数据
 */

#include "Single_action.h"

/**
 * @brief  重置所有舵机角度为默认
 */
const uint16_t Reset_Whole_Data[][3] = {
    {1, 131, 1000},  {2, 872, 1000},  {3, 466, 1000},  {4, 489, 1000},
    {5, 113, 1000},{6, 914, 1000},  {7, 484, 1000},  {8, 478, 1000},  
    {9, 49, 1000},  {10, 880, 1000},{11, 486, 1000}, {12, 446, 1000}, 
    {13, 99, 1000}, {14, 843, 1000}, {15, 458, 1000},{16, 396, 1000},
    {17, 500, 1000}, {18, 500, 1000}, {19, 500, 1000},{20, 500, 1000}
};
const uint8_t Reset_Whole_Count = sizeof(Reset_Whole_Data) / sizeof(Reset_Whole_Data[0]);
